cscopeTree.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>cscopeTree</title>
<!-- 2016-05-05 Thu 17:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Alan O Hung Lun" />
</head>
<body>
<div id="content">
<h1 class="title">cscopeTree</h1>
<p>
These 45 lines of code steer cscope to build and navigate a tree of caller sequence of a given symbol.
Each node contains function name and its file path.
The function f has access to both the nodes of callee and callers. 
It can easily print out command to do text manipulation, such as 
</p>
<pre class="example">
c:\snapshot\ice1_main_dev\LNX&gt; sed -i 's/\(callerName.*\)/\1\\nDB_LOG_ADDF(DB_LOG_NUM_SA_TIME_BASE,callerIndex);/g' callerFilePath
</pre>

<div class="org-src-container">

<pre class="src src-C">import Data.Tree
import System.Process
import System.Environment
import Data.List.Split (splitOn)
import Data.List (nub,sort)
type SymbolName = String
data ScopeInfo = ScopeInfo {symbolName :: SymbolName
                           ,filePath :: FilePath
                            ,index :: String
                           } deriving (Read,Show)

removeDup :: (Eq a, Eq b) =&gt; [(a,b)] -&gt; [(a,b)]
removeDup [] = []
removeDup [x] = [x]
removeDup (x:y:xs) = if fst x == fst y then (removeDup (x:xs)) else x:(removeDup (y:xs))

f :: ScopeInfo -&gt; IO (ScopeInfo, [ScopeInfo])
f s = do
  c &lt;- readCreateProcess (shell ("cscope -dL0 " ++ (symbolName s))) ""
  let results = lines c
  let fpath = ((!! 0) . (!! 0) . filter  (\x -&gt; x!!1 == symbolName s) . map (splitOn " ")  ) results
  let callers = filter (\x -&gt; x!!1 `notElem` [symbolName s,"&lt;global&gt;","defined"]) $map ( splitOn " ") results
  let callersUniq = removeDup $map (\x-&gt; (x!!1,x!!0)) callers
  print [symbolName s,index s]
--  print (map fst callersUniq)
  print "-------------------------------------------------------------"
  if (length $index s) &lt; 3 then 
      return (ScopeInfo (symbolName s) fpath (index s) , map (\((x,y),z) -&gt; ScopeInfo  x y ((index s)++(show z)) ) (zip callersUniq [1..] ))             
  else
      return (ScopeInfo (symbolName s) fpath (index s) , [])            

ioUnfoldTree :: (ScopeInfo -&gt; IO (ScopeInfo, [ScopeInfo])) -&gt; ScopeInfo -&gt; IO (Tree ScopeInfo)
ioUnfoldTree f s = do
  (x, xs) &lt;- f s
  forest &lt;- ioUnfoldForest f xs
  return (Node x forest)

ioUnfoldForest :: (ScopeInfo -&gt; IO (ScopeInfo, [ScopeInfo])) -&gt; [ScopeInfo] -&gt; IO [Tree ScopeInfo]
ioUnfoldForest f bs = sequence $map (ioUnfoldTree f) bs

main = do
  args &lt;- getArgs
  result &lt;- ioUnfoldTree f (ScopeInfo (args!!0) "" "0")
  return ""
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alan O Hung Lun (<a href="mailto:"></a>)</p>
<p class="date">Date: 2016-05-05 Thu 17:33</p>
</div>
</body>
</html>
